Tekla Open API Reference for Tekla Structures 2025
AnalysisModelGeneralProperties.FilterName Property
 The name of the filter.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string FilterName { get; set; }
Public Property FilterName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
AnalysisModelGeneralProperties Class
Tekla.Structures.Analysis Namespace